Repository: voed/Spedit
Catalog: Properties/Resources.*.resx
Languages: ru

# SavingUFiles
source: Save all unsaved files?
ru: Русский

source: Saving
ru: Сервер запущен

source: Compile all
ru: Сохранение

# Language
source: English
ru: Сохранить все несохранённые файлы?

source: Server running
ru: Скомпилировать всё

# CompileCurr
source: Compile current
ru: Скомпилировать текущий файл

source: Copy
ru: Копировать

# FTPUp
source: FTP Upload
ru: Загрузка через FTP

source: Start server
ru: Запустить сервер

source: Replace
ru: Заменить

source: Replace all
ru: Заменить всё

source: Open new file
ru: Открыть новый файл

# NoFileOpened
source: No files opened
ru: Открытых файлов нет

# NoFileOpenedCap
source: None of the selected files could be opened.
ru: Ни один из выбраных файлов не может быть открыт.

source: Save file as
ru: Сохранить как...

# SaveFollow
source: Save following files
ru: Сохранить следующие файлы

# ChDecomp
source: Select plugin to decompile
ru: Выбрать плагин для декомпилирования

source: Decompiling
ru: Декомпилирование

# EditConfig
source: Edit Configurations
ru: Редактировать конфиги

# FoundInOff
source: Found in offset {0} with length {1}
ru: Найдено в смещении {0} размером {1}

source: Found nothing
ru: Ничего не найдено

# ReplacedOff
source: Replaced in offset {0}
ru: Заменено в смещении {0}

# ReplacedOcc
source: Replaced {0} occurences in {1} documents
ru: Произведено {0} замен в документе {1}

# OccFound
source: occurences found
ru: совпадений найдено

# EmptyPatt
source: Empty search pattern
ru: Поисковый шаблон пуст

# NoValidRegex
source: No valid regex pattern
ru: Неправильный шаблон

# FailedCheck
source: Failed to check
ru: Не удалось проверить

# ErrorUpdate
source: Error while checking for updates.
ru: Ошибка проверки обновлений

# VersUpToDate
source: Version up to date
ru: Обновление не требуется

# VersionYour
source: Your program version {0} is up to date.
ru: Ваша версия {0} программы - самая свежая.

source: Details
ru: Подробности

source: Compiling
ru: Компилирование

source: Error
ru: Ошибка

# SPCompNotStarted
source: The spcomp.exe compiler did not started correctly.
ru: Компилятор spcomp.exe не был корректно запущен.

# SPCompNotFound
source: The spcomp.exe compiler could not be found.
ru: Файл компилятора spcomp.exe не найден.

source: Copied
ru: Скопировано

source: Deleted
ru: Удалено

# FailCopy
source: Failed to copy
ru: Не удалось скопировать

# NoFilesCopy
source: No files copied
ru: Файлы не были скопированы

source: Uploaded
ru: Загружено

# ErrorUploadFile
source: Error while uploading file: {0} to {1}
ru: Ошибка при загрузке файла: {0} в {1}

# ErrorUpload
source: Error while uploading files
ru: Ошибка при загрузке файлов

source: Done
ru: готово

# FileStr
source: File
ru: Файл

source: New
ru: Новый

source: Open
ru: Открыть

source: Save
ru: Сохранить

source: Save all
ru: Сохранить всё

source: Save as
ru: Сохранить как...

source: Close
ru: Закрыть

source: Close all
ru: Закрыть всё

source: Build
ru: Сборка

# CopyPlugin
source: Copy Plugins
ru: Скопировать плагины

# SendRCon
source: Senc RCon commands
ru: Отправить RCon команду

# Config
source: Configuration
ru: Конфиги

source: Edit
ru: Редактировать

source: Undo
ru: Отмена

source: Redo
ru: Повтор

source: Cut
ru: Вырезать

source: Paste
ru: Вставить

# Folding
source: Foldings
ru: Блоки

source: Expand all
ru: Развернуть все

source: Collapse all
ru: Свернуть все

source: Jump to
ru: Перейти к

# TogglComment
source: Toggle comment
ru: Раз-/Закомментировать

source: Select all
ru: Выбрать всё

source: Find & Replace
ru: Поиск и замена

source: Tools
ru: Инструменты

source: Options
ru: Настройки программы

# ParsedIncDir
source: Parsed from include directory
ru: Установленный на ПК

# OldAPIWeb
source: Old API webside
ru: Страница старого API

# NewAPIWeb
source: New API webside
ru: Страница нового API

# Reformatter
source: Syntax reformatter
ru: Переформатирование синтаксиса

# ReformatCurr
source: Reformat current
ru: Переформатировать текущий

source: Reformat all
ru: Переформатировать все

source: Decompile
ru: Декомпилировать

# ReportBugGit
source: Report bug on GitHub
ru: Отправить на GitHub сообщение об ошибке

# CheckUpdates
source: Check for updates
ru: Проверить наличие обновлений

source: About
ru: О программе

source: File Name
ru: Имя файла

source: Line
ru: Строка

# TypeStr
source: Type
ru: Тип

source: Normal search
ru: Нормальный поиск

source: Match whole words
ru: Совпадение всех слов

# AdvancSearch
source: Advanced search
ru: Расширенный поиск

source: Regex search
ru: Регулярные выражения

# CurrDoc
source: Current document
ru: Текущий документ

# AllDoc
source: All open documents
ru: Все открытые документы

source: Find
ru: Найти

source: Count
ru: Считать

# CaseSen
source: Case sensitive
ru: Учитывать регистр

source: Multiline Regex
ru: Многострочная регулярка

# ErrorFileLoadProc
source: Error while loading and processing the file.
ru: Ошибка при загрузке и обработке файла.

# NotDissMethod
source: Could not disassemble method {0}: {1}
ru: Не удалось разобрать метод {0}: {1}

# DFileChanged
source: {0} has changed.
ru: {0} был изменён.

source: File changed
ru: Файл изменён

# FileTryReload
source: Try reloading file?
ru: Перезагрузить файл?

# DSaveError
source: An error occured while saving.
ru: Ошибка при сохранении.

source: Save error
ru: Ошибка сохранения

source: Saving file
ru: Сохранение файлов

# PtAbb
source: pt
ru: пункт

# ColAbb
source: Col
ru: Столбец

# LnAbb
source: Ln
ru: Строка

# LenAbb
source: Len
ru: Длина

# SPEditCap
source: a lightweight sourcepawn editor
ru: легкий редактор SourcePawn

# WrittenBy
source: written by: {0}
ru: Автор: {0}

source: License
ru: Лицензия

# PeopleInv
source: People involved
ru: Помогали:

source: Preview
ru: Предпросмотр

source: New file
ru: Новый файл

# ConfigWrongPars
source: The config was not able to parse a sourcepawn definiton.
ru: Конфиг не смог прочесть определения SourcePawn.

source: no name
ru: без имени

# PosLen
source: (pos: {0} - len: {1})
ru: поз: {0} - длн: {1}

source: inherited from
ru: унаследовано от

source: Method from
ru: Method из

source: Property from
ru: Property из

source: search
ru: поиск

source: Delete
ru: Удалить

source: Name
ru: Имя

# ScriptDir
source: Scripting directories
ru: Папки скриптов

# DelimiedWi
source: delimit with
ru: Разделять

# CopyDir
source: Copy directory
ru: Копировать папку

# ServerExe
source: Server executable
ru: Исполняемый файл сервера

# serverStartArgs
source: Server-start arguments
ru: Аргументы запуска сервера

# PreBuildCom
source: Pre-Build commandline
ru: Pre-Build командная строка

# PostBuildCom
source: Post-Build commandline
ru: Post-Build командная строка

# OptimizeLvl
source: Optimization level
ru: Оптимизация

# VerboseLvl
source: Verbose level
ru: Уровень оптимизации

# AutoCopy
source: Auto copy after compile
ru: Скопировать после компиляции

# DeleteOldSMX
source: Delete old .smx after copy
ru: Удалить старый .smx после копирования

source: FTP host
ru: Хост FTP

source: FTP user
ru: Пользователь FTP

# FTPPw
source: FTP password
ru: Пароль FTP

# FTPDir
source: FTP upload-directory
ru: Папка FTP

# ComEditorDir
source: Directory of the SPEdit binary
ru: Расположение исполняемого файла SPEdit

# ComScriptDir
source: Directory of the Compiling script
ru: Расположение компилируемых скриптов

# ComCopyDir
source: Directory where the smx should be copied
ru: Место для хранения копируемых smx

# ComScriptName
source: File Name of the script
ru: Имя файла скрипта

# ComPluginName
source: File Name of the compiled script
ru: Имя скомпилированного скрипта

# RConEngine
source: RCon server engine
ru: Движок RCon сервера

# RConIP
source: RCon server IP
ru: IP адрес RCon сервера

# RconPort
source: RCon server port
ru: Порт RCon сервера

# RconPw
source: RCon server password
ru: Пароль RCon сервера

# RconCom
source: RCon Server commands
ru: Команды RCon сервера

# ComPluginsReload
source: Reloads all compiled plugins
ru: Перезапустить все скомпилированные плагины

# ComPluginsLoad
source: Loads all compiled plugins
ru: Запустить все скомпилированные плагины

# ComPluginsUnload
source: Unloads all compiled plugins
ru: Выгрузить все скомпилированные плагины

source: New config
ru: Новый конфиг

# CannotDelConf
source: Cannot delete config
ru: Нельзя удалить конфиг

# YCannotDelConf
source: You cannot delete this config.
ru: Вы не можете удалить этот конфиг!

# SelectExe
source: Select executable
ru: Выберите исполняемый файл

# CMDLineCom
source: Commandline variables
ru: Переменные командной строки

# RConCMDLineCom
source: Rcon commandline variables
ru: Переменные командной строки Rcon

source: Reset options
ru: Сброс опций

# ResetOptQues
source: Are you sure, you want to reset the options?
ru: Вы уверены, что хотите произвести сброс опций?

source: Restart Editor
ru: Перезапустить редактор

# YRestartEditor
source: You have to restart the editor for the changes to have effect.
ru: Вы должны перезапустить редактор для применения изменений.

# RestartEdiFullEff
source: Restart editor to take full effect...
ru: Перезапуск редактора для полного эффекта...

# RestartEdiEff
source: Restart editor to take effect...
ru: Перезапуск редактора для полного эффекта...

source: Program
ru: Программа

# HardwareAcc
source: Use hardware acceleration (if available)
ru: Использовать аппаратное ускорение (если возможно)

# UIAnim
source: UI animations
ru: Анимация интерфейса

# OpenInc
source: Auto open includes
ru: Автоматическое использование инклюдов

# OpenIncRec
source: Open Includes Recursively
ru: Открывать инклюды рекурсивно

# AutoUpdate
source: Search automatically for updates
ru: Автоматический поиск обновлений

source: Show toolbar
ru: Отобразить панель инструментов

# DynamicISAC
source: Dynamic Autocompletition/Intellisense
ru: Динамическое автодополнение

source: Dark theme
ru: Тёмная тема

source: Theme Color
ru: Цвет темы

# LanguageStr
source: Language
ru: Язык

source: Editor
ru: Редактор

source: Font size
ru: Размер шрифтов

source: Scroll speed
ru: Скорость прокрутки

source: Word wrap
ru: Перенос слов

# AggIndentation
source: Agressive Indentation
ru: Агрессивный отступ

# ReformatAfterSem
source: Reformatting line after semicolon
ru: Переформатирование строки после точки с запятой

# TabsToSpace
source: Replace tabs with spaces
ru: Заменить табуляцию пробелами

# AutoCloseBrack
source: Auto close brackets
ru: Автозакрытие скобок

# AutoCloseStrChr
source: Auto close Strings, Chars
ru: Автозакрытие кавычек для типов String, Char

source: Show spaces
ru: Отображать пробелы

source: Show tabs
ru: Отображать табуляцию

source: Indentation size
ru: Размер отступа

# FontFamily
source: Font
ru: Шрифт

# SyntaxHigh
source: Syntaxhighlighting
ru: Подсветка синтаксиса

# HighDeprecat
source: Highlight deprecated (<1.7) syntax
ru: Подсветка устаревшего (&lt;1.7) синтаксиса

source: Compile
ru: Компиляция

source: Auto save (min)
ru: Aвтосохранение (мин)
